/*
=========================================================================================================
DDL-скрипт: Создание бронзовой таблицы
=========================================================================================================
Цель сценария: 
	Этот скрипт создаёт таблицу в «бронзовой» схеме, удаляя существующую таблицу, если она уже существует. 
	Поскольку исходный файл имеет только одну таблицу, идет только ее загрузка.
	Запуск этого скрипта переопределит структуру DDL «бронзовой» таблицы
===========================================================================================================
*/
IF OBJECT_ID ('bronze.brazil.dataset', 'U') IS NOT NULL
	DROP TABLE bronze.brazil.dataset; 
CREATE TABLE bronze.brazil.dataset (
	overall NVARCHAR(MAX)
	);
