/*
=========================================================================================================
DDL-скрипт: Создание бронзовой таблицы
=========================================================================================================
Цель сценария: 
	Этот скрипт создаёт таблицу в «бронзовой» схеме, удаляя существующую таблицу, если она уже существует. 
	Таблица имеет одну колонку Rawline, поскольку данные в сыром файле не имеют четкого разделителя.
	Запустите этот скрипт, чтобы переопределить структуру DDL «бронзовой» таблицы
===========================================================================================================
*/
IF OBJECT_ID ('bronze.Rawline', 'U') IS NOT NULL
	DROP TABLE bronze.Rawline; 
CREATE TABLE bronze.Rawline (
	RawLine NVARCHAR(MAX)
	);
