/*
===============================================================================
Сохранённая процедура: загрузка бронзового слоя (исходный источник -> бронза)
=============================================================================== 
Назначение скрипта: 
  Эта сохранённая процедура загружает данные в схему «бронза» из внешнего CSV-файла. 
  Это позволяет нам внести данные из файла для последующего преобразования и разделения на слое Silver.
  Поскольку в сыром виде все данные собраны в одну таблицу, то на бронзовом слое выполняется только одна вставка.

ВАЖНО:
  Поменять ссылку на актуальную папку для вашей папки с файлом Brazilian E-Commerce Public Dataset by Olist.csv.

Параметры: 
  Отсутствуют. 
  Эта сохранённая процедура не принимает параметры и не возвращает значения. 
 
Пример использования: 
  EXEC bronze.load_bronze;
===============================================================================
*/
CREATE OR ALTER PROCEDURE bronze.load_bronze AS
BEGIN
	DECLARE @start_time DATETIME, @end_time DATETIME;

		SET @start_time = GETDATE();
		PRINT '--------------------------------------------------';	
		PRINT '>> Очистка таблицы: bronze.brazil_dataset';
		PRINT '--------------------------------------------------';	

		TRUNCATE TABLE bronze.brazil_dataset;

		PRINT '--------------------------------------------------';	
		PRINT '>> Вставка данных в таблицу: bronze.brazil_dataset';
		PRINT '--------------------------------------------------';

		BULK INSERT bronze.brazil_dataset
		FROM 'E:\Senna010594\Brazilian E-Commerce Public Dataset by Olist.csv'
		WITH (
			FIRSTROW = 2,
			FIELDTERMINATOR = ',',
			TABLOCK
		);
		SET @end_time = GETDATE();

		PRINT '=====================================================';
		PRINT 'Загрузка бронзового слоя завершена';
		PRINT '     - Общаяя длительность загрузки: ' +  CAST(DATEDIFF(second, @start_time, @end_time) AS NVARCHAR) + 'секунд';
		PRINT '=====================================================';
END
