/*
===============================================================================
Сохранённая процедура: загрузка бронзового слоя (исходный источник -> бронза)
=============================================================================== 
Назначение скрипта: 
  Эта сохранённая процедура загружает данные в схему «бронза» из внешнего CSV-файлf. 
  Поскольку в исходном файле присутствуют битые разделители, то первоначальная загрузка идет в формате Rawline.
  Это позволяет нам внести данные из файла для последующего преобразования и разделения на слое Silver.

ВАЖНО:
  Поменять ссылку на актуальную папку для вашей папки с файлом amazon.csv.

Параметры: 
  Отсутствуют. 
  Эта сохранённая процедура не принимает параметры и не возвращает значения. 
 
Пример использования: 
  EXEC bronze.Rawline;
===============================================================================
*/

CREATE OR ALTER PROCEDURE bronze.Rawline AS
BULK INSERT bronze.Rawline
		FROM 'E:\Amazon\amazon.csv'
		WITH (
			FIRSTROW = 2,
			ROWTERMINATOR = '\n',
			TABLOCK
		);
